<?php

use Illuminate\Database\Seeder;
use App\Models\Category;
use App\Models\Item;
use App\Models\Catalog;

class CICTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $types = [
            '劳务分包' => [
                '泥工' => ['泥工班组-地库砼','泥工班组-楼层砼','泥工班组-二次结构','泥工班组-支撑体系','泥工班组-整体'],
                '模板' => ['木工班组-正负零以下','木工班组-正负零以下非人防','木工班组-正负零以下人防','木工班组-正负零以上','木工班组-支撑体系','木工班组-整体','铝膜班组'],
                '钢筋' => ['钢筋班组-加工','钢筋班组-安装','钢筋班组-植筋','钢筋班组-整体'],
                '架子' => ['架子班组-正负零以上','架子班组-正负零以下'],
                'PC' => ['装配班组-PC构件安装'],
                '粉刷' => ['粉刷班组-内墙','粉刷班组-外墙','粉刷班组-楼地面','粉刷班组-屋面','粉刷班组-整体'],
                '砌体' => ['砌砖班组'],
                '零星' => ['零星班组'],
            ],
            '专业分包' => [
                '基坑相关' => [],
                '公共区域精装修' => [],
                '静电地板' => [],
                '安装工程' => [],
                '防水' => [],
                '油漆' => [],
                '真石漆' => [],
                '干挂石材' => [],
                '特殊门窗' => [],
                '普通门窗' => [],
                '栏杆' => [],
                '电梯' => [],
                '室外附属' => [],
            ],
            '材料' => [
                '钢材' => [],
                '商混1' => [],
                '商混2' => [],
                '砌体材料' => [],
                '砂浆' => [],
                '墙地砖' => [],
                '厨房排烟道' => [],
                '金属网片' => [],
                'PC构件' => [],
                '保温板' => [],
                '网格布' => [],
                '止水' => [],
                '资源' => [],
            ],
            '租赁或损耗材料' => [
                '临时机械' => [],
                '模板' => [],
                '脚手架' => [],
                '易损材料' => [],
            ],
            '临时建筑与设施' => [
                '彩钢板房' => [],
                '设施' => [],
                '安全文明施工费' => [],
            ],
            '企业管理费' => [
                '管理人员' => [],
                '其他人员' => [],
                '办公费' => [],
                '检验试验费' => [],
                '咨询费' => [],
                '其他' => [],
            ],
            '财务成本及工程项目管理费' => [
                '规费' => ['规费'],
                '资金成本' => ['资金盈余及占用','履约保涵费用'],
                '增值税' => ['进项税','应交税金'],
            ],
            '集团成本' => [
                '集团成本' => ['上交公司管理费','上交集团所得税']
            ]
        ];
        
        collect($types)->each(function ($item,$key) {
            dump($key,$item);
            $category = Category::create(['name' => $key]);
            foreach($item as $k=>$v){
                dump($k,$v);
                $item = Item::create(['name' => $k,'category_id' => $category->id]);
                foreach($v as $n){
                    Catalog::create(['name' => $n,'item_id' => $item->id]);
                }
            }
        });
    }
}
